RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_xmc.c
/**
 **************************************************************************
 * File Name    : at32f4xx_xmc.c
 * Description  : at32f4xx XMC source file
 * Date         : 2018-02-26
 * Version      : V1.0.4
 **************************************************************************
 */


/* Includes ------------------------------------------------------------------*/
#include "at32f4xx_xmc.h"
#include "at32f4xx_rcc.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @defgroup XMC
  * @brief XMC driver modules
  * @{
  */

#if defined (AT32F403xx) || defined (AT32F403Axx) || defined (AT32F407xx)

/** @defgroup XMC_Private_TypesDefinitions
  * @{
  */
/**
  * @}
  */

/** @defgroup XMC_Private_Defines
  * @{
  */

/* --------------------- XMC registers bit mask ---------------------------- */

/* XMC BCRx Mask */
#define BK1CTRLx_EN_Set                     ((uint32_t)0x00000001)
#define BK1CTRLx_EN_Reset                   ((uint32_t)0x000FFFFE)
#define BK1CTRLx_NOREN_Set                  ((uint32_t)0x00000040)

/* XMC PCRx Mask */
#define BKxCTRL_EN_Set                      ((uint32_t)0x00000004)
#define BKxCTRL_EN_Reset                    ((uint32_t)0x000FFFFB)
#define BKxCTRL_ECCEN_Set                   ((uint32_t)0x00000040)
#define BKxCTRL_ECCEN_Reset                 ((uint32_t)0x000FFFBF)
#define BKxCTRL_Device_NAND                 ((uint32_t)0x00000008)
/**
  * @}
  */

/** @defgroup XMC_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup XMC_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup XMC_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */

/** @defgroup XMC_Private_Functions
  * @{
  */

/**
  * @brief  Deinitializes the XMC NOR/SRAM Banks registers to their default
  *         reset values.
  * @param  XMC_Bank: specifies the XMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg XMC_Bank1_NORSRAM1: XMC Bank1 NOR/SRAM1
  *     @arg XMC_Bank1_NORSRAM2: XMC Bank1 NOR/SRAM2
  *     @arg XMC_Bank1_NORSRAM3: XMC Bank1 NOR/SRAM3
  *     @arg XMC_Bank1_NORSRAM4: XMC Bank1 NOR/SRAM4
  * @retval None
  */
void XMC_NORSRAMReset(uint32_t XMC_Bank)
{
  /* Check the parameter */
  assert_param(IS_XMC_NORSRAM_REGION(XMC_Bank));

  /* XMC_Bank1_NORSRAM1 */
  if(XMC_Bank == XMC_Bank1_NORSRAM1)
  {
    XMC_Bank1->BK1CTRLR[XMC_Bank] = 0x000030DB;
  }
  /* XMC_Bank1_NORSRAM2,  XMC_Bank1_NORSRAM3 or XMC_Bank1_NORSRAM4 */
  else
  {
    XMC_Bank1->BK1CTRLR[XMC_Bank] = 0x000030D2;
  }

  XMC_Bank1->BK1CTRLR[XMC_Bank + 1] = 0x0FFFFFFF;
  XMC_Bank1E->BK1TMGWR[XMC_Bank] = 0x0FFFFFFF;
}

/**
  * @brief  Deinitializes the XMC NAND Banks registers to their default reset values.
  * @param  XMC_Bank: specifies the XMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg XMC_Bank2_NAND: XMC Bank2 NAND
  *     @arg XMC_Bank3_NAND: XMC Bank3 NAND
  * @retval None
  */
void XMC_NANDReset(uint32_t XMC_Bank)
{
  /* Check the parameter */
  assert_param(IS_XMC_NAND_BANK(XMC_Bank));

  if(XMC_Bank == XMC_Bank2_NAND)
  {
    /* Set the XMC_Bank2 registers to their reset values */
    XMC_Bank2->BK2CTRL = 0x00000018;
    XMC_Bank2->BK2STS = 0x00000040;
    XMC_Bank2->BK2TMGMEM = 0xFCFCFCFC;
    XMC_Bank2->BK2TMGATT = 0xFCFCFCFC;
  }
  /* XMC_Bank3_NAND */
  else
  {
    /* Set the XMC_Bank3 registers to their reset values */
    XMC_Bank3->BK3CTRL = 0x00000018;
    XMC_Bank3->BK3STS = 0x00000040;
    XMC_Bank3->BK3TMGMEM = 0xFCFCFCFC;
    XMC_Bank3->BK3TMGATT = 0xFCFCFCFC;
  }
}

/**
  * @brief  Deinitializes the XMC PCCARD Bank registers to their default reset values.
  * @param  None
  * @retval None
  */
void XMC_PCCARDReset(void)
{
  /* Set the XMC_Bank4 registers to their reset values */
  XMC_Bank4->BK4CTRL = 0x00000018;
  XMC_Bank4->BK4STS = 0x00000000;
  XMC_Bank4->BK4TMGMEM = 0xFCFCFCFC;
  XMC_Bank4->BK4TMGATT = 0xFCFCFCFC;
  XMC_Bank4->BK4TMGIO = 0xFCFCFCFC;
}

/**
  * @brief  Initializes the XMC NOR/SRAM Banks according to the specified
  *         parameters in the XMC_NORSRAMInitStruct.
  * @param  XMC_NORSRAMInitStruct : pointer to a XMC_NORSRAMInitType
  *         structure that contains the configuration information for
  *        the XMC NOR/SRAM specified Banks.
  * @retval None
  */
void XMC_NORSRAMInit(XMC_NORSRAMInitType* XMC_NORSRAMInitStruct)
{
  /* Check the parameters */
  assert_param(IS_XMC_NORSRAM_REGION(XMC_NORSRAMInitStruct->XMC_Bank));
  assert_param(IS_XMC_MUX(XMC_NORSRAMInitStruct->XMC_DataAdrMux));
  assert_param(IS_XMC_DEVICE(XMC_NORSRAMInitStruct->XMC_Dev));
  assert_param(IS_XMC_BUS_TYPE(XMC_NORSRAMInitStruct->XMC_BusType));
  assert_param(IS_XMC_BURSTMODE(XMC_NORSRAMInitStruct->XMC_EnableBurstMode));
  assert_param(IS_XMC_ASYNWAIT(XMC_NORSRAMInitStruct->XMC_EnableAsynWait));
  assert_param(IS_XMC_WAIT_SIGNAL_LEVEL(XMC_NORSRAMInitStruct->XMC_WaitSignalLv));
  assert_param(IS_XMC_BURSTMODE_SPLIT(XMC_NORSRAMInitStruct->XMC_EnableBurstModeSplit));
  assert_param(IS_XMC_WAIT_SIGNAL_CONFIG(XMC_NORSRAMInitStruct->XMC_WaitSignalConfig));
  assert_param(IS_XMC_WRITE_OPERATION(XMC_NORSRAMInitStruct->XMC_EnableWrite));
  assert_param(IS_XMC_WAIT_SIGNAL(XMC_NORSRAMInitStruct->XMC_EnableWaitSignal));
  assert_param(IS_XMC_WRITE_TIMING(XMC_NORSRAMInitStruct->XMC_EnableWriteTiming));
  assert_param(IS_XMC_WRITE_BURST_SYN(XMC_NORSRAMInitStruct->XMC_WriteBurstSyn));
  assert_param(IS_XMC_ADDRESS_OP_TIME(XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_AdrOpTime));
  assert_param(IS_XMC_ADDRESS_HOLD_TIME(XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_AdrHoldTime));
  assert_param(IS_XMC_DATA_OP_TIME(XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_DataOpTime));
  assert_param(IS_XMC_INTERVAL_BETWEEN_OP_TIME(XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_IntervalBetweenOP));
  assert_param(IS_XMC_CLK_DIV(XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_CLKPsc));
  assert_param(IS_XMC_DATA_STABLE_TIME(XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_DataStableTime));
  assert_param(IS_XMC_MODE(XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_Mode));

  /* Bank1 NOR/SRAM control register configuration */
  XMC_Bank1->BK1CTRLR[XMC_NORSRAMInitStruct->XMC_Bank] =
    (uint32_t)XMC_NORSRAMInitStruct->XMC_DataAdrMux |
    XMC_NORSRAMInitStruct->XMC_Dev |
    XMC_NORSRAMInitStruct->XMC_BusType |
    XMC_NORSRAMInitStruct->XMC_EnableBurstMode |
    XMC_NORSRAMInitStruct->XMC_EnableAsynWait |
    XMC_NORSRAMInitStruct->XMC_WaitSignalLv |
    XMC_NORSRAMInitStruct->XMC_EnableBurstModeSplit |
    XMC_NORSRAMInitStruct->XMC_WaitSignalConfig |
    XMC_NORSRAMInitStruct->XMC_EnableWrite |
    XMC_NORSRAMInitStruct->XMC_EnableWaitSignal |
    XMC_NORSRAMInitStruct->XMC_EnableWriteTiming |
    XMC_NORSRAMInitStruct->XMC_WriteBurstSyn;

