RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_xmc.c
  if(XMC_NORSRAMInitStruct->XMC_Dev == XMC_Dev_NOR)
  {
    XMC_Bank1->BK1CTRLR[XMC_NORSRAMInitStruct->XMC_Bank] |= (uint32_t)BK1CTRLx_NOREN_Set;
  }

  /* Bank1 NOR/SRAM timing register configuration */
  XMC_Bank1->BK1CTRLR[XMC_NORSRAMInitStruct->XMC_Bank + 1] =
    (uint32_t)XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_AdrOpTime |
    (XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_AdrHoldTime << 4) |
    (XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_DataOpTime << 8) |
    (XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_IntervalBetweenOP << 16) |
    (XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_CLKPsc << 20) |
    (XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_DataStableTime << 24) |
    XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_Mode;


  /* Bank1 NOR/SRAM timing register for write configuration, if extended mode is used */
  if(XMC_NORSRAMInitStruct->XMC_EnableWriteTiming == XMC_WriteTiming_Enable)
  {
    assert_param(IS_XMC_ADDRESS_OP_TIME(XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_AdrOpTime));
    assert_param(IS_XMC_ADDRESS_HOLD_TIME(XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_AdrHoldTime));
    assert_param(IS_XMC_DATA_OP_TIME(XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_DataOpTime));
    assert_param(IS_XMC_CLK_DIV(XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_CLKPsc));
    assert_param(IS_XMC_DATA_STABLE_TIME(XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_DataStableTime));
    assert_param(IS_XMC_MODE(XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_Mode));
    XMC_Bank1E->BK1TMGWR[XMC_NORSRAMInitStruct->XMC_Bank] =
      (uint32_t)XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_AdrOpTime |
      (XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_AdrHoldTime << 4 ) |
      (XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_DataOpTime << 8) |
      (XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_CLKPsc << 20) |
      (XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_DataStableTime << 24) |
      XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_Mode;
  }
  else
  {
    XMC_Bank1E->BK1TMGWR[XMC_NORSRAMInitStruct->XMC_Bank] = 0x0FFFFFFF;
  }
}

/**
  * @brief  Initializes the XMC NAND Banks according to the specified
  *         parameters in the XMC_NANDInitStruct.
  * @param  XMC_NANDInitStruct : pointer to a XMC_NANDInitType
  *         structure that contains the configuration information for the XMC
  *         NAND specified Banks.
  * @retval None
  */
void XMC_NANDInit(XMC_NANDInitType* XMC_NANDInitStruct)
{
  uint32_t tmppcr = 0x00000000, tmppmem = 0x00000000, tmppatt = 0x00000000;

  /* Check the parameters */
  assert_param( IS_XMC_NAND_BANK(XMC_NANDInitStruct->XMC_Bank));
  assert_param( IS_XMC_WAIT_OPERATION(XMC_NANDInitStruct->XMC_EnableWait));
  assert_param( IS_XMC_BUS_TYPE(XMC_NANDInitStruct->XMC_BusType));
  assert_param( IS_XMC_ECC_OPERATION(XMC_NANDInitStruct->XMC_EnableECC));
  assert_param( IS_XMC_ECCPAGE_SIZE(XMC_NANDInitStruct->XMC_ECCPageSize));
  assert_param( IS_XMC_DELAY_CR_TIME(XMC_NANDInitStruct->XMC_DelayTimeCR));
  assert_param( IS_XMC_DELAY_AR_TIME(XMC_NANDInitStruct->XMC_DelayTimeAR));
  assert_param(IS_XMC_SETUP_TIME(XMC_NANDInitStruct->XMC_CommonSpaceTimingStruct->XMC_SetupTime));
  assert_param(IS_XMC_OP_TIME(XMC_NANDInitStruct->XMC_CommonSpaceTimingStruct->XMC_OpTime));
  assert_param(IS_XMC_HOLD_TIME(XMC_NANDInitStruct->XMC_CommonSpaceTimingStruct->XMC_HoldTime));
  assert_param(IS_XMC_WRITE_SETUP_TIME(XMC_NANDInitStruct->XMC_CommonSpaceTimingStruct->XMC_WriteSetupTime));
  assert_param(IS_XMC_SETUP_TIME(XMC_NANDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_SetupTime));
  assert_param(IS_XMC_OP_TIME(XMC_NANDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_OpTime));
  assert_param(IS_XMC_HOLD_TIME(XMC_NANDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_HoldTime));
  assert_param(IS_XMC_WRITE_SETUP_TIME(XMC_NANDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_WriteSetupTime));

  /* Set the tmppcr value according to XMC_NANDInitStruct parameters */
  tmppcr = (uint32_t)XMC_NANDInitStruct->XMC_EnableWait |
           BKxCTRL_Device_NAND |
           XMC_NANDInitStruct->XMC_BusType |
           XMC_NANDInitStruct->XMC_EnableECC |
           XMC_NANDInitStruct->XMC_ECCPageSize |
           (XMC_NANDInitStruct->XMC_DelayTimeCR << 9 ) |
           (XMC_NANDInitStruct->XMC_DelayTimeAR << 13);

  /* Set tmppmem value according to XMC_CommonSpaceTimingStructure parameters */
  tmppmem = (uint32_t)XMC_NANDInitStruct->XMC_CommonSpaceTimingStruct->XMC_SetupTime |
            (XMC_NANDInitStruct->XMC_CommonSpaceTimingStruct->XMC_OpTime << 8) |
            (XMC_NANDInitStruct->XMC_CommonSpaceTimingStruct->XMC_HoldTime << 16) |
            (XMC_NANDInitStruct->XMC_CommonSpaceTimingStruct->XMC_WriteSetupTime << 24);

  /* Set tmppatt value according to XMC_AttributeSpaceTimingStructure parameters */
  tmppatt = (uint32_t)XMC_NANDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_SetupTime |
            (XMC_NANDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_OpTime << 8) |
            (XMC_NANDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_HoldTime << 16) |
            (XMC_NANDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_WriteSetupTime << 24);

  if(XMC_NANDInitStruct->XMC_Bank == XMC_Bank2_NAND)
  {
    /* XMC_Bank2_NAND registers configuration */
    XMC_Bank2->BK2CTRL = tmppcr;
    XMC_Bank2->BK2TMGMEM = tmppmem;
    XMC_Bank2->BK2TMGATT = tmppatt;
  }
  else
  {
    /* XMC_Bank3_NAND registers configuration */
    XMC_Bank3->BK3CTRL = tmppcr;
    XMC_Bank3->BK3TMGMEM = tmppmem;
    XMC_Bank3->BK3TMGATT = tmppatt;
  }
}

/**
  * @brief  Initializes the XMC PCCARD Bank according to the specified
  *         parameters in the XMC_PCCARDInitStruct.
  * @param  XMC_PCCARDInitStruct : pointer to a XMC_PCCARDInitType
  *         structure that contains the configuration information for the XMC
  *         PCCARD Bank.
  * @retval None
  */
void XMC_PCCARDInit(XMC_PCCARDInitType* XMC_PCCARDInitStruct)
{
  /* Check the parameters */
  assert_param(IS_XMC_WAIT_OPERATION(XMC_PCCARDInitStruct->XMC_EnableWait));
  assert_param(IS_XMC_DELAY_CR_TIME(XMC_PCCARDInitStruct->XMC_DelayTimeCR));
  assert_param(IS_XMC_DELAY_AR_TIME(XMC_PCCARDInitStruct->XMC_DelayTimeAR));

