RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_xmc.c
  assert_param(IS_XMC_SETUP_TIME(XMC_PCCARDInitStruct->XMC_CommonSpaceTimingStruct->XMC_SetupTime));
  assert_param(IS_XMC_OP_TIME(XMC_PCCARDInitStruct->XMC_CommonSpaceTimingStruct->XMC_OpTime));
  assert_param(IS_XMC_HOLD_TIME(XMC_PCCARDInitStruct->XMC_CommonSpaceTimingStruct->XMC_HoldTime));
  assert_param(IS_XMC_WRITE_SETUP_TIME(XMC_PCCARDInitStruct->XMC_CommonSpaceTimingStruct->XMC_WriteSetupTime));

  assert_param(IS_XMC_SETUP_TIME(XMC_PCCARDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_SetupTime));
  assert_param(IS_XMC_OP_TIME(XMC_PCCARDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_OpTime));
  assert_param(IS_XMC_HOLD_TIME(XMC_PCCARDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_HoldTime));
  assert_param(IS_XMC_WRITE_SETUP_TIME(XMC_PCCARDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_WriteSetupTime));
  assert_param(IS_XMC_SETUP_TIME(XMC_PCCARDInitStruct->XMC_IOSpaceTimingStruct->XMC_SetupTime));
  assert_param(IS_XMC_OP_TIME(XMC_PCCARDInitStruct->XMC_IOSpaceTimingStruct->XMC_OpTime));
  assert_param(IS_XMC_HOLD_TIME(XMC_PCCARDInitStruct->XMC_IOSpaceTimingStruct->XMC_HoldTime));
  assert_param(IS_XMC_WRITE_SETUP_TIME(XMC_PCCARDInitStruct->XMC_IOSpaceTimingStruct->XMC_WriteSetupTime));

  /* Set the PCR4 register value according to XMC_PCCARDInitStruct parameters */
  XMC_Bank4->BK4CTRL = (uint32_t)XMC_PCCARDInitStruct->XMC_EnableWait |
                       XMC_BusType_16b |
                       (XMC_PCCARDInitStruct->XMC_DelayTimeCR << 9) |
                       (XMC_PCCARDInitStruct->XMC_DelayTimeAR << 13);

  /* Set PMEM4 register value according to XMC_CommonSpaceTimingStructure parameters */
  XMC_Bank4->BK4TMGMEM = (uint32_t)XMC_PCCARDInitStruct->XMC_CommonSpaceTimingStruct->XMC_SetupTime |
                         (XMC_PCCARDInitStruct->XMC_CommonSpaceTimingStruct->XMC_OpTime << 8) |
                         (XMC_PCCARDInitStruct->XMC_CommonSpaceTimingStruct->XMC_HoldTime << 16) |
                         (XMC_PCCARDInitStruct->XMC_CommonSpaceTimingStruct->XMC_WriteSetupTime << 24);

  /* Set PATT4 register value according to XMC_AttributeSpaceTimingStructure parameters */
  XMC_Bank4->BK4TMGATT = (uint32_t)XMC_PCCARDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_SetupTime |
                         (XMC_PCCARDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_OpTime << 8) |
                         (XMC_PCCARDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_HoldTime << 16) |
                         (XMC_PCCARDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_WriteSetupTime << 24);

  /* Set PIO4 register value according to XMC_IOSpaceTimingStructure parameters */
  XMC_Bank4->BK4TMGIO = (uint32_t)XMC_PCCARDInitStruct->XMC_IOSpaceTimingStruct->XMC_SetupTime |
                        (XMC_PCCARDInitStruct->XMC_IOSpaceTimingStruct->XMC_OpTime << 8) |
                        (XMC_PCCARDInitStruct->XMC_IOSpaceTimingStruct->XMC_HoldTime << 16) |
                        (XMC_PCCARDInitStruct->XMC_IOSpaceTimingStruct->XMC_WriteSetupTime << 24);
}

/**
  * @brief  Fills each XMC_NORSRAMInitStruct member with its default value.
  * @param  XMC_NORSRAMInitStruct: pointer to a XMC_NORSRAMInitType
  *         structure which will be initialized.
  * @retval None
  */
void XMC_NORSRAMStructInit(XMC_NORSRAMInitType* XMC_NORSRAMInitStruct)
{
  /* Reset NOR/SRAM Init structure parameters values */
  XMC_NORSRAMInitStruct->XMC_Bank = XMC_Bank1_NORSRAM1;
  XMC_NORSRAMInitStruct->XMC_DataAdrMux = XMC_DataAdrMux_Enable;
  XMC_NORSRAMInitStruct->XMC_Dev = XMC_Dev_SRAM;
  XMC_NORSRAMInitStruct->XMC_BusType = XMC_BusType_8b;
  XMC_NORSRAMInitStruct->XMC_EnableBurstMode = XMC_BurstMode_Disable;
  XMC_NORSRAMInitStruct->XMC_EnableAsynWait = XMC_AsynWait_Disable;
  XMC_NORSRAMInitStruct->XMC_WaitSignalLv = XMC_WaitSignalLv_Low;
  XMC_NORSRAMInitStruct->XMC_EnableBurstModeSplit = XMC_BurstModeSplit_Disable;
  XMC_NORSRAMInitStruct->XMC_WaitSignalConfig = XMC_WaitSignalConfig_BeforeWaitState;
  XMC_NORSRAMInitStruct->XMC_EnableWrite = XMC_WriteOperation_Enable;
  XMC_NORSRAMInitStruct->XMC_EnableWaitSignal = XMC_WaitSignal_Enable;
  XMC_NORSRAMInitStruct->XMC_EnableWriteTiming = XMC_WriteTiming_Disable;
  XMC_NORSRAMInitStruct->XMC_WriteBurstSyn = XMC_WriteBurstSyn_Disable;
  XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_AdrOpTime = 0xF;
  XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_AdrHoldTime = 0xF;
  XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_DataOpTime = 0xFF;
  XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_IntervalBetweenOP = 0xF;
  XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_CLKPsc = 0xF;
  XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_DataStableTime = 0xF;
  XMC_NORSRAMInitStruct->XMC_RWTimingStruct->XMC_Mode = XMC_Mode_A;
  XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_AdrOpTime = 0xF;
  XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_AdrHoldTime = 0xF;
  XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_DataOpTime = 0xFF;
  XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_IntervalBetweenOP = 0xF;
  XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_CLKPsc = 0xF;
  XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_DataStableTime = 0xF;
  XMC_NORSRAMInitStruct->XMC_WTimingStruct->XMC_Mode = XMC_Mode_A;
}

/**
  * @brief  Fills each XMC_NANDInitStruct member with its default value.
  * @param  XMC_NANDInitStruct: pointer to a XMC_NANDInitType
  *         structure which will be initialized.
  * @retval None
  */
void XMC_NANDStructInit(XMC_NANDInitType* XMC_NANDInitStruct)
{
  /* Reset NAND Init structure parameters values */
  XMC_NANDInitStruct->XMC_Bank = XMC_Bank2_NAND;
  XMC_NANDInitStruct->XMC_EnableWait = XMC_WaitOperation_Disable;
  XMC_NANDInitStruct->XMC_BusType = XMC_BusType_8b;
  XMC_NANDInitStruct->XMC_EnableECC = XMC_ECCOperation_Disable;
  XMC_NANDInitStruct->XMC_ECCPageSize = XMC_ECCPageSize_256Bytes;
  XMC_NANDInitStruct->XMC_DelayTimeCR = 0x0;
  XMC_NANDInitStruct->XMC_DelayTimeAR = 0x0;
  XMC_NANDInitStruct->XMC_CommonSpaceTimingStruct->XMC_SetupTime = 0xFC;
  XMC_NANDInitStruct->XMC_CommonSpaceTimingStruct->XMC_OpTime = 0xFC;
  XMC_NANDInitStruct->XMC_CommonSpaceTimingStruct->XMC_HoldTime = 0xFC;
  XMC_NANDInitStruct->XMC_CommonSpaceTimingStruct->XMC_WriteSetupTime = 0xFC;
  XMC_NANDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_SetupTime = 0xFC;
  XMC_NANDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_OpTime = 0xFC;
  XMC_NANDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_HoldTime = 0xFC;
  XMC_NANDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_WriteSetupTime = 0xFC;
}

/**
  * @brief  Fills each XMC_PCCARDInitStruct member with its default value.
  * @param  XMC_PCCARDInitStruct: pointer to a XMC_PCCARDInitType
  *         structure which will be initialized.
  * @retval None
  */
void XMC_PCCARDStructInit(XMC_PCCARDInitType* XMC_PCCARDInitStruct)
{
  /* Reset PCCARD Init structure parameters values */
  XMC_PCCARDInitStruct->XMC_EnableWait = XMC_WaitOperation_Disable;
  XMC_PCCARDInitStruct->XMC_DelayTimeCR = 0x0;
  XMC_PCCARDInitStruct->XMC_DelayTimeAR = 0x0;
  XMC_PCCARDInitStruct->XMC_CommonSpaceTimingStruct->XMC_SetupTime = 0xFC;
  XMC_PCCARDInitStruct->XMC_CommonSpaceTimingStruct->XMC_OpTime = 0xFC;
  XMC_PCCARDInitStruct->XMC_CommonSpaceTimingStruct->XMC_HoldTime = 0xFC;
  XMC_PCCARDInitStruct->XMC_CommonSpaceTimingStruct->XMC_WriteSetupTime = 0xFC;
  XMC_PCCARDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_SetupTime = 0xFC;
  XMC_PCCARDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_OpTime = 0xFC;
  XMC_PCCARDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_HoldTime = 0xFC;
  XMC_PCCARDInitStruct->XMC_AttributeSpaceTimingStruct->XMC_WriteSetupTime = 0xFC;
  XMC_PCCARDInitStruct->XMC_IOSpaceTimingStruct->XMC_SetupTime = 0xFC;
  XMC_PCCARDInitStruct->XMC_IOSpaceTimingStruct->XMC_OpTime = 0xFC;
  XMC_PCCARDInitStruct->XMC_IOSpaceTimingStruct->XMC_HoldTime = 0xFC;
  XMC_PCCARDInitStruct->XMC_IOSpaceTimingStruct->XMC_WriteSetupTime = 0xFC;
}

/**
  * @brief  Config the bus turnaround phase
  * @param  XMC_SubBank: specifies the XMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg XMC_SubBank1_NORSRAM1: XMC SubBank1 NOR/SRAM1
  *     @arg XMC_SubBank1_NORSRAM2: XMC SubBank1 NOR/SRAM2
  *     @arg XMC_SubBank1_NORSRAM3: XMC SubBank1 NOR/SRAM3
  *     @arg XMC_SubBank1_NORSRAM4: XMC SubBank1 NOR/SRAM4
  * @param  W2W_Timing: Bus turnaround phase for consecutive write duration.from 0 to 255 HCLK, default:8 HCLK
  * @param  R2R_Timing: Bus turnaround phase for consecutive read duration.from 0 to 255 HCLK, default:8 HCLK
  * @retval None
  */
void XMC_ExtTimingConfig(uint32_t XMC_SubBank, uint8_t W2W_Timing, uint8_t R2R_Timing)
{
  assert_param(IS_XMC_Sub_NORSRAM_REGION(XMC_SubBank));

  XMC_Bank1H->BK1EXT[XMC_SubBank] &= 0;
  XMC_Bank1H->BK1EXT[XMC_SubBank] |= (W2W_Timing|(R2R_Timing<<8));
}

/**
  * @brief  Enables or disables the specified NOR/SRAM Memory Bank.
  * @param  XMC_Bank: specifies the XMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg XMC_Bank1_NORSRAM1: XMC Bank1 NOR/SRAM1
  *     @arg XMC_Bank1_NORSRAM2: XMC Bank1 NOR/SRAM2
  *     @arg XMC_Bank1_NORSRAM3: XMC Bank1 NOR/SRAM3
  *     @arg XMC_Bank1_NORSRAM4: XMC Bank1 NOR/SRAM4
  * @param  NewState: new state of the XMC_Bank. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void XMC_NORSRAMCmd(uint32_t XMC_Bank, FunctionalState NewState)
{
  assert_param(IS_XMC_NORSRAM_REGION(XMC_Bank));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the selected NOR/SRAM Bank by setting the PBKEN bit in the BCRx register */
    XMC_Bank1->BK1CTRLR[XMC_Bank] |= BK1CTRLx_EN_Set;
  }
  else
  {
    /* Disable the selected NOR/SRAM Bank by clearing the PBKEN bit in the BCRx register */
    XMC_Bank1->BK1CTRLR[XMC_Bank] &= BK1CTRLx_EN_Reset;
  }
}

/**
  * @brief  Enables or disables the specified NAND Memory Bank.
  * @param  XMC_Bank: specifies the XMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg XMC_Bank2_NAND: XMC Bank2 NAND
  *     @arg XMC_Bank3_NAND: XMC Bank3 NAND
  * @param  NewState: new state of the XMC_Bank. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void XMC_NANDCmd(uint32_t XMC_Bank, FunctionalState NewState)
{
  assert_param(IS_XMC_NAND_BANK(XMC_Bank));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the selected NAND Bank by setting the PBKEN bit in the PCRx register */
    if(XMC_Bank == XMC_Bank2_NAND)
    {
      XMC_Bank2->BK2CTRL |= BKxCTRL_EN_Set;
    }
    else
    {
      XMC_Bank3->BK3CTRL |= BKxCTRL_EN_Set;
    }
  }
  else
  {
    /* Disable the selected NAND Bank by clearing the PBKEN bit in the PCRx register */
    if(XMC_Bank == XMC_Bank2_NAND)
    {
      XMC_Bank2->BK2CTRL &= BKxCTRL_EN_Reset;
    }
    else
    {
      XMC_Bank3->BK3CTRL &= BKxCTRL_EN_Reset;
    }
  }
}

/**
  * @brief  Enables or disables the PCCARD Memory Bank.
  * @param  NewState: new state of the PCCARD Memory Bank.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void XMC_PCCARDCmd(FunctionalState NewState)
{
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the PCCARD Bank by setting the PBKEN bit in the PCR4 register */
    XMC_Bank4->BK4CTRL |= BKxCTRL_EN_Set;
  }
  else
  {
    /* Disable the PCCARD Bank by clearing the PBKEN bit in the PCR4 register */
    XMC_Bank4->BK4CTRL &= BKxCTRL_EN_Reset;
  }
}

/**
  * @brief  Enables or disables the XMC NAND ECC feature.
  * @param  XMC_Bank: specifies the XMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg XMC_Bank2_NAND: XMC Bank2 NAND
  *     @arg XMC_Bank3_NAND: XMC Bank3 NAND
  * @param  NewState: new state of the XMC NAND ECC feature.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void XMC_NANDECCCmd(uint32_t XMC_Bank, FunctionalState NewState)
{
  assert_param(IS_XMC_NAND_BANK(XMC_Bank));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the selected NAND Bank ECC function by setting the ECCEN bit in the PCRx register */
    if(XMC_Bank == XMC_Bank2_NAND)
    {
      XMC_Bank2->BK2CTRL |= BKxCTRL_ECCEN_Set;
    }
    else
    {
      XMC_Bank3->BK3CTRL |= BKxCTRL_ECCEN_Set;
    }
  }
  else
  {
    /* Disable the selected NAND Bank ECC function by clearing the ECCEN bit in the PCRx register */
    if(XMC_Bank == XMC_Bank2_NAND)
    {
      XMC_Bank2->BK2CTRL &= BKxCTRL_ECCEN_Reset;
    }
    else
    {
      XMC_Bank3->BK3CTRL &= BKxCTRL_ECCEN_Reset;
    }
  }
}

/**
  * @brief  Returns the error correction code register value.
  * @param  XMC_Bank: specifies the XMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg XMC_Bank2_NAND: XMC Bank2 NAND
  *     @arg XMC_Bank3_NAND: XMC Bank3 NAND
  * @retval The Error Correction Code (ECC) value.
  */
uint32_t XMC_GetECC(uint32_t XMC_Bank)
{
  uint32_t eccval = 0x00000000;

  if(XMC_Bank == XMC_Bank2_NAND)
  {
    /* Get the BK2ECC register value */
    eccval = XMC_Bank2->BK2ECC;
  }
  else
  {
    /* Get the BK3ECC register value */
    eccval = XMC_Bank3->BK3ECC;
  }

  /* Return the error correction code value */
  return(eccval);
}

/**
  * @brief  Enables or disables the specified XMC interrupts.
  * @param  XMC_Bank: specifies the XMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg XMC_Bank2_NAND: XMC Bank2 NAND
  *     @arg XMC_Bank3_NAND: XMC Bank3 NAND
  *     @arg XMC_Bank4_PCCARD: XMC Bank4 PCCARD
  * @param  XMC_INT: specifies the XMC interrupt sources to be enabled or disabled.
  *   This parameter can be any combination of the following values:
  *     @arg XMC_INT_RisingEdge: Rising edge detection interrupt.
  *     @arg XMC_INT_Level: Level edge detection interrupt.
  *     @arg XMC_INT_FallingEdge: Falling edge detection interrupt.
  * @param  NewState: new state of the specified XMC interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void XMC_INTConfig(uint32_t XMC_Bank, uint32_t XMC_INT, FunctionalState NewState)
{
  assert_param(IS_XMC_INT_BANK(XMC_Bank));
  assert_param(IS_XMC_INT(XMC_INT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the selected XMC_Bank2 interrupts */
    if(XMC_Bank == XMC_Bank2_NAND)
    {
      XMC_Bank2->BK2STS |= XMC_INT;
    }
    /* Enable the selected XMC_Bank3 interrupts */
    else if (XMC_Bank == XMC_Bank3_NAND)
    {
      XMC_Bank3->BK3STS |= XMC_INT;
    }
    /* Enable the selected XMC_Bank4 interrupts */
    else
    {
      XMC_Bank4->BK4STS |= XMC_INT;
    }
  }
  else
  {
    /* Disable the selected XMC_Bank2 interrupts */
    if(XMC_Bank == XMC_Bank2_NAND)
    {

      XMC_Bank2->BK2STS &= (uint32_t)~XMC_INT;
    }
    /* Disable the selected XMC_Bank3 interrupts */
    else if (XMC_Bank == XMC_Bank3_NAND)
    {
      XMC_Bank3->BK3STS &= (uint32_t)~XMC_INT;
    }
    /* Disable the selected XMC_Bank4 interrupts */
    else
    {
      XMC_Bank4->BK4STS &= (uint32_t)~XMC_INT;
    }
  }
}

/**
  * @brief  Checks whether the specified XMC flag is set or not.
  * @param  XMC_Bank: specifies the XMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg XMC_Bank2_NAND: XMC Bank2 NAND
  *     @arg XMC_Bank3_NAND: XMC Bank3 NAND
  *     @arg XMC_Bank4_PCCARD: XMC Bank4 PCCARD
  * @param  XMC_FLAG: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg XMC_FLAG_RisingEdge: Rising egde detection Flag.
  *     @arg XMC_FLAG_Level: Level detection Flag.
  *     @arg XMC_FLAG_FallingEdge: Falling egde detection Flag.
  *     @arg XMC_FLAG_FEMPT: Fifo empty Flag.
  * @retval The new state of XMC_FLAG (SET or RESET).
  */
FlagStatus XMC_GetFlagStatus(uint32_t XMC_Bank, uint32_t XMC_FLAG)
{
  FlagStatus bitstatus = RESET;
  uint32_t tmpsr = 0x00000000;

  /* Check the parameters */
  assert_param(IS_XMC_GETFLAG_BANK(XMC_Bank));
  assert_param(IS_XMC_GET_FLAG(XMC_FLAG));

  if(XMC_Bank == XMC_Bank2_NAND)
  {
    tmpsr = XMC_Bank2->BK2STS;
  }
  else if(XMC_Bank == XMC_Bank3_NAND)
  {
    tmpsr = XMC_Bank3->BK3STS;
  }
  /* XMC_Bank4_PCCARD*/
  else
  {
    tmpsr = XMC_Bank4->BK4STS;
  }

  /* Get the flag status */
  if ((tmpsr & XMC_FLAG) != (uint16_t)RESET )
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  /* Return the flag status */
  return bitstatus;
}

/**
  * @brief  Clears the XMC's pending flags.
  * @param  XMC_Bank: specifies the XMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg XMC_Bank2_NAND: XMC Bank2 NAND
  *     @arg XMC_Bank3_NAND: XMC Bank3 NAND
  *     @arg XMC_Bank4_PCCARD: XMC Bank4 PCCARD
  * @param  XMC_FLAG: specifies the flag to clear.
  *   This parameter can be any combination of the following values:
  *     @arg XMC_FLAG_RisingEdge: Rising egde detection Flag.
  *     @arg XMC_FLAG_Level: Level detection Flag.
  *     @arg XMC_FLAG_FallingEdge: Falling egde detection Flag.
  * @retval None
  */
void XMC_ClearFlag(uint32_t XMC_Bank, uint32_t XMC_FLAG)
{
  /* Check the parameters */
  assert_param(IS_XMC_GETFLAG_BANK(XMC_Bank));
  assert_param(IS_XMC_CLEAR_FLAG(XMC_FLAG)) ;

  if(XMC_Bank == XMC_Bank2_NAND)
  {
    XMC_Bank2->BK2STS &= ~XMC_FLAG;
  }
  else if(XMC_Bank == XMC_Bank3_NAND)
  {
    XMC_Bank3->BK3STS &= ~XMC_FLAG;
  }
  /* XMC_Bank4_PCCARD*/
  else
  {
    XMC_Bank4->BK4STS &= ~XMC_FLAG;
  }
}

/**
  * @brief  Checks whether the specified XMC interrupt has occurred or not.
  * @param  XMC_Bank: specifies the XMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg XMC_Bank2_NAND: XMC Bank2 NAND
  *     @arg XMC_Bank3_NAND: XMC Bank3 NAND
  *     @arg XMC_Bank4_PCCARD: XMC Bank4 PCCARD
  * @param  XMC_INT: specifies the XMC interrupt source to check.
  *   This parameter can be one of the following values:
  *     @arg XMC_INT_RisingEdge: Rising edge detection interrupt.
  *     @arg XMC_INT_Level: Level edge detection interrupt.
  *     @arg XMC_INT_FallingEdge: Falling edge detection interrupt.
  * @retval The new state of XMC_INT (SET or RESET).
  */
ITStatus XMC_GetINTStatus(uint32_t XMC_Bank, uint32_t XMC_INT)
{
  ITStatus bitstatus = RESET;
  uint32_t tmpsr = 0x0, itstatus = 0x0, itenable = 0x0;

  /* Check the parameters */
  assert_param(IS_XMC_INT_BANK(XMC_Bank));
  assert_param(IS_XMC_GET_INT(XMC_INT));

  if(XMC_Bank == XMC_Bank2_NAND)
  {
    tmpsr = XMC_Bank2->BK2STS;
  }
  else if(XMC_Bank == XMC_Bank3_NAND)
  {
    tmpsr = XMC_Bank3->BK3STS;
  }
  /* XMC_Bank4_PCCARD*/
  else
  {
    tmpsr = XMC_Bank4->BK4STS;
  }

  itstatus = tmpsr & XMC_INT;

  itenable = tmpsr & (XMC_INT >> 3);

  if ((itstatus != (uint32_t)RESET)  && (itenable != (uint32_t)RESET))
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return bitstatus;
}

/**
  * @brief  Clears the XMC's interrupt pending bits.
  * @param  XMC_Bank: specifies the XMC Bank to be used
  *   This parameter can be one of the following values:
  *     @arg XMC_Bank2_NAND: XMC Bank2 NAND
  *     @arg XMC_Bank3_NAND: XMC Bank3 NAND
  *     @arg XMC_Bank4_PCCARD: XMC Bank4 PCCARD
  * @param  XMC_INT: specifies the interrupt pending bit to clear.
  *   This parameter can be any combination of the following values:
  *     @arg XMC_INT_RisingEdge: Rising edge detection interrupt.
  *     @arg XMC_INT_Level: Level edge detection interrupt.
  *     @arg XMC_INT_FallingEdge: Falling edge detection interrupt.
  * @retval None
  */
void XMC_ClearINTPendingBit(uint32_t XMC_Bank, uint32_t XMC_INT)
{
  /* Check the parameters */
  assert_param(IS_XMC_INT_BANK(XMC_Bank));
  assert_param(IS_XMC_INT(XMC_INT));

  if(XMC_Bank == XMC_Bank2_NAND)
  {
    XMC_Bank2->BK2STS &= ~(XMC_INT >> 3);
  }
  else if(XMC_Bank == XMC_Bank3_NAND)
  {
    XMC_Bank3->BK3STS &= ~(XMC_INT >> 3);
  }
  /* XMC_Bank4_PCCARD*/
  else
  {
    XMC_Bank4->BK4STS &= ~(XMC_INT >> 3);
  }
}

/**
  * @}
  */

#endif /* AT32F403xx || AT32F403Axx || AT32F407xx */

/**
  * @}
  */

/**
  * @}
  */


